## New Drift Detected

### Drift Detected & Auto-Remediation Started

Terraform has detected changes in the infrastructure that are not in the state file.
Auto-fix will be applied automatically.

<details>
<summary>Show Plan</summary>

```terraform
random_id.bucket_suffix: Refreshing state... [id=6pn29A]
aws_vpc.main: Refreshing state... [id=vpc-027437c275230a1fe]
aws_s3_bucket.my_bucket: Refreshing state... [id=day-30-terraform-amals-practice-ea99f6f4]
aws_s3_bucket_ownership_controls.my_bucket: Refreshing state... [id=day-30-terraform-amals-practice-ea99f6f4]
aws_s3_bucket_server_side_encryption_configuration.my_bucket: Refreshing state... [id=day-30-terraform-amals-practice-ea99f6f4]
aws_s3_bucket_public_access_block.my_bucket: Refreshing state... [id=day-30-terraform-amals-practice-ea99f6f4]
aws_s3_bucket_versioning.my_bucket: Refreshing state... [id=day-30-terraform-amals-practice-ea99f6f4]
aws_s3_bucket_acl.my_bucket: Refreshing state... [id=day-30-terraform-amals-practice-ea99f6f4,private]
aws_internet_gateway.main: Refreshing state... [id=igw-091d493b79b9ee92e]
aws_subnet.private[1]: Refreshing state... [id=subnet-0122efe989f80e7a9]
aws_subnet.private[0]: Refreshing state... [id=subnet-041994a3db8adf565]
aws_route_table.private[1]: Refreshing state... [id=rtb-0398097bdc0fd3ff3]
aws_security_group.alb_sg: Refreshing state... [id=sg-01fbbc3ef268e4ee6]
aws_route_table.private[0]: Refreshing state... [id=rtb-0044c8b5131313de6]
aws_lb_target_group.app_tg: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:326864272150:targetgroup/app-tg-production/07ac88a00a58a699]
aws_security_group.allow_ssh: Refreshing state... [id=sg-06f2fd36dab1dbbdc]
aws_route_table.public: Refreshing state... [id=rtb-01a15f557ac0726eb]
aws_security_group.allow_https: Refreshing state... [id=sg-0557b7f16e5e4e379]
aws_security_group.allow_http: Refreshing state... [id=sg-088b7ad4442584a32]
aws_subnet.public[0]: Refreshing state... [id=subnet-08cee7c9e6980c483]
aws_subnet.public[1]: Refreshing state... [id=subnet-019e28469eac175e8]
aws_eip.main[1]: Refreshing state... [id=eipalloc-00ea9fb64f6eda478]
aws_eip.main[0]: Refreshing state... [id=eipalloc-0907dc7807620076e]
aws_route.public: Refreshing state... [id=r-rtb-01a15f557ac0726eb1080289494]
aws_security_group.app_sg: Refreshing state... [id=sg-0d0dedfdb14d44190]
aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-021ec971fb4b9b4da]
aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0ef16cbfb8e105c43]
aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-07494346ac59eb52f]
aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0df226b9538758a04]
aws_lb.app_lb: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:326864272150:loadbalancer/app/app-lb-production/f9cba2c528c07d5f]
aws_launch_template.app: Refreshing state... [id=lt-0afeb375e893065ed]
aws_autoscaling_group.app_asg: Refreshing state... [id=app-asg-production]
aws_lb_listener.http_listener: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:326864272150:listener/app/app-lb-production/f9cba2c528c07d5f/0ef0fb6282e5b70e]
aws_nat_gateway.main[1]: Refreshing state... [id=nat-0d4a73a0143388f54]
aws_nat_gateway.main[0]: Refreshing state... [id=nat-0d1b13ba66eb6c6ae]
aws_route.private[0]: Refreshing state... [id=r-rtb-0044c8b5131313de61080289494]
aws_route.private[1]: Refreshing state... [id=r-rtb-0398097bdc0fd3ff31080289494]
aws_autoscaling_policy.scale_out: Refreshing state... [id=scale-out]
aws_autoscaling_policy.scale_in: Refreshing state... [id=scale-in]
aws_autoscaling_policy.target_tracking: Refreshing state... [id=target-tracking-policy]
aws_cloudwatch_metric_alarm.high_cpu: Refreshing state... [id=high-cpu-utilization]
aws_cloudwatch_metric_alarm.low_cpu: Refreshing state... [id=low-cpu-utilization]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_autoscaling_group.app_asg must be replaced
-/+ resource "aws_autoscaling_group" "app_asg" {
      ~ arn                              = "arn:aws:autoscaling:us-east-1:326864272150:autoScalingGroup:20357822-8445-48a4-a8a9-e8431f94a7dd:autoScalingGroupName/app-asg-production" -> (known after apply)
      ~ availability_zones               = [
          - "us-east-1a",
          - "us-east-1b",
        ] -> (known after apply)
      - capacity_rebalance               = false -> null
      ~ default_cooldown                 = 300 -> (known after apply)
      - default_instance_warmup          = 0 -> null
      ~ desired_capacity                 = 1 -> 2
      - enabled_metrics                  = [] -> null
      ~ id                               = "app-asg-production" -> (known after apply)
      ~ load_balancers                   = [] -> (known after apply)
      - max_instance_lifetime            = 0 -> null
      ~ name                             = "app-asg-production" -> "app-asg-prod" # forces replacement
      + name_prefix                      = (known after apply)
      ~ predicted_capacity               = 0 -> (known after apply)
      ~ service_linked_role_arn          = "arn:aws:iam::326864272150:role/aws-service-role/autoscaling.amazonaws.com/AWSServiceRoleForAutoScaling" -> (known after apply)
      - suspended_processes              = [] -> null
      ~ target_group_arns                = [
          - "arn:aws:elasticloadbalancing:us-east-1:326864272150:targetgroup/app-tg-production/07ac88a00a58a699",
        ] -> (known after apply)
      - termination_policies             = [] -> null
      ~ warm_pool_size                   = 0 -> (known after apply)
        # (15 unchanged attributes hidden)

      ~ availability_zone_distribution (known after apply)
      - availability_zone_distribution {
          - capacity_distribution_strategy = "balanced-best-effort" -> null
        }

      ~ capacity_reservation_specification (known after apply)
      - capacity_reservation_specification {
          - capacity_reservation_preference = "default" -> null
        }

      ~ launch_template {
            id      = "lt-0afeb375e893065ed"
          ~ name    = "app-launch-template-20260206113133497200000004" -> (known after apply)
            # (1 unchanged attribute hidden)
        }

      ~ mixed_instances_policy (known after apply)

      ~ traffic_source (known after apply)
      - traffic_source {
          - identifier = "arn:aws:elasticloadbalancing:us-east-1:326864272150:targetgroup/app-tg-production/07ac88a00a58a699" -> null
          - type       = "elbv2" -> null
        }

        # (1 unchanged block hidden)
    }

  # aws_autoscaling_policy.scale_in must be replaced
-/+ resource "aws_autoscaling_policy" "scale_in" {
      ~ arn                       = "arn:aws:autoscaling:us-east-1:326864272150:scalingPolicy:36da03b6-828e-4f19-8e19-82d13497b1cd:autoScalingGroupName/app-asg-production:policyName/scale-in" -> (known after apply)
      ~ autoscaling_group_name    = "app-asg-production" -> "app-asg-prod" # forces replacement
      - estimated_instance_warmup = 0 -> null
      ~ id                        = "scale-in" -> (known after apply)
      + metric_aggregation_type   = (known after apply)
      - min_adjustment_magnitude  = 0 -> null
        name                      = "scale-in"
        # (5 unchanged attributes hidden)
    }

  # aws_autoscaling_policy.scale_out must be replaced
-/+ resource "aws_autoscaling_policy" "scale_out" {
      ~ arn                       = "arn:aws:autoscaling:us-east-1:326864272150:scalingPolicy:4fe753d2-926c-4e3c-b6f7-362f4cb82784:autoScalingGroupName/app-asg-production:policyName/scale-out" -> (known after apply)
      ~ autoscaling_group_name    = "app-asg-production" -> "app-asg-prod" # forces replacement
      - estimated_instance_warmup = 0 -> null
      ~ id                        = "scale-out" -> (known after apply)
      + metric_aggregation_type   = (known after apply)
      - min_adjustment_magnitude  = 0 -> null
        name                      = "scale-out"
        # (5 unchanged attributes hidden)
    }

  # aws_autoscaling_policy.target_tracking must be replaced
-/+ resource "aws_autoscaling_policy" "target_tracking" {
      ~ arn                       = "arn:aws:autoscaling:us-east-1:326864272150:scalingPolicy:54e23d5c-dbd9-4ea7-8afc-3d7f25be0f84:autoScalingGroupName/app-asg-production:policyName/target-tracking-policy" -> (known after apply)
      ~ autoscaling_group_name    = "app-asg-production" -> "app-asg-prod" # forces replacement
      - cooldown                  = 0 -> null
      - estimated_instance_warmup = 0 -> null
      ~ id                        = "target-tracking-policy" -> (known after apply)
      + metric_aggregation_type   = (known after apply)
      - min_adjustment_magnitude  = 0 -> null
        name                      = "target-tracking-policy"
      - scaling_adjustment        = 0 -> null
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_cloudwatch_metric_alarm.high_cpu will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "high_cpu" {
      ~ alarm_actions                         = [
          - "arn:aws:autoscaling:us-east-1:326864272150:scalingPolicy:4fe753d2-926c-4e3c-b6f7-362f4cb82784:autoScalingGroupName/app-asg-production:policyName/scale-out",
        ] -> (known after apply)
      ~ dimensions                            = {
          ~ "AutoScalingGroupName" = "app-asg-production" -> "app-asg-prod"
        }
        id                                    = "high-cpu-utilization"
      ~ tags                                  = {
          - "Environment" = "production" -> null
        }
      ~ tags_all                              = {
          ~ "Environment" = "production" -> "prod"
            # (2 unchanged elements hidden)
        }
        # (19 unchanged attributes hidden)
    }

  # aws_cloudwatch_metric_alarm.low_cpu will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "low_cpu" {
      ~ alarm_actions                         = [
          - "arn:aws:autoscaling:us-east-1:326864272150:scalingPolicy:36da03b6-828e-4f19-8e19-82d13497b1cd:autoScalingGroupName/app-asg-production:policyName/scale-in",
        ] -> (known after apply)
      ~ dimensions                            = {
          ~ "AutoScalingGroupName" = "app-asg-production" -> "app-asg-prod"
        }
        id                                    = "low-cpu-utilization"
      ~ tags                                  = {
          - "Environment" = "production" -> null
        }
      ~ tags_all                              = {
          ~ "Environment" = "production" -> "prod"
            # (2 unchanged elements hidden)
        }
        # (19 unchanged attributes hidden)
    }

  # aws_eip.main[0] will be updated in-place
  ~ resource "aws_eip" "main" {
        id                       = "eipalloc-0907dc7807620076e"
      ~ tags                     = {
          - "Environment" = "production" -> null
            "Name"        = "nat-eip-az-1"
        }
      ~ tags_all                 = {
          ~ "Environment" = "production" -> "prod"
            # (3 unchanged elements hidden)
        }
        # (17 unchanged attributes hidden)
    }

  # aws_eip.main[1] will be updated in-place
  ~ resource "aws_eip" "main" {
        id                       = "eipalloc-00ea9fb64f6eda478"
      ~ tags                     = {
          - "Environment" = "production" -> null
            "Name"        = "nat-eip-az-2"
        }
      ~ tags_all                 = {
          ~ "Environment" = "production" -> "prod"
            # (3 unchanged elements hidden)
        }
        # (17 unchanged attributes hidden)
    }

  # aws_internet_gateway.main will be updated in-place
  ~ resource "aws_internet_gateway" "main" {
        id       = "igw-091d493b79b9ee92e"
      ~ tags     = {
          - "Environment" = "production" -> null
            "Name"        = "main-internet-gateway"
        }
      ~ tags_all = {
          ~ "Environment" = "production" -> "prod"
            # (3 unchanged elements hidden)
        }
        # (3 unchanged attributes hidden)
    }

  # aws_launch_template.app will be updated in-place
  ~ resource "aws_launch_template" "app" {
        id                                   = "lt-0afeb375e893065ed"
      ~ latest_version                       = 1 -> (known after apply)
        name                                 = "app-launch-template-20260206113133497200000004"
      ~ tags                                 = {
          - "Environment" = "production" -> null
        }
      ~ tags_all                             = {
          ~ "Environment" = "production" -> "prod"
            # (2 unchanged elements hidden)
        }
      ~ vpc_security_group_ids               = [
          - "sg-06f2fd36dab1dbbdc",
          - "sg-0d0dedfdb14d44190",
        ] -> (known after apply)
        # (15 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_lb.app_lb must be replaced
-/+ resource "aws_lb" "app_lb" {
      ~ arn                                                          = "arn:aws:elasticloadbalancing:us-east-1:326864272150:loadbalancer/app/app-lb-production/f9cba2c528c07d5f" -> (known after apply)
      ~ arn_suffix                                                   = "app/app-lb-production/f9cba2c528c07d5f" -> (known after apply)
      ~ dns_name                                                     = "app-lb-production-1415074233.us-east-1.elb.amazonaws.com" -> (known after apply)
      - enable_cross_zone_load_balancing                             = true -> null
      + enforce_security_group_inbound_rules_on_private_link_traffic = (known after apply)
      ~ id                                                           = "arn:aws:elasticloadbalancing:us-east-1:326864272150:loadbalancer/app/app-lb-production/f9cba2c528c07d5f" -> (known after apply)
      ~ ip_address_type                                              = "ipv4" -> (known after apply)
      ~ name                                                         = "app-lb-production" -> "app-lb-prod" # forces replacement
      + name_prefix                                                  = (known after apply)
      ~ security_groups                                              = [
          - "sg-01fbbc3ef268e4ee6",
        ] -> (known after apply)
      ~ tags                                                         = {
          - "Environment" = "production" -> null
            "Name"        = "app-load-balancer-updated-1"
        }
      ~ tags_all                                                     = {
          ~ "Environment" = "production" -> "prod"
            # (3 unchanged elements hidden)
        }
      ~ vpc_id                                                       = "vpc-027437c275230a1fe" -> (known after apply)
      ~ zone_id                                                      = "Z35SXDOTRQ7X7K" -> (known after apply)
        # (16 unchanged attributes hidden)

      - access_logs {
          - enabled = false -> null
            # (2 unchanged attributes hidden)
        }

      - connection_logs {
          - enabled = false -> null
            # (2 unchanged attributes hidden)
        }

      ~ subnet_mapping (known after apply)
      - subnet_mapping {
          - subnet_id            = "subnet-019e28469eac175e8" -> null
            # (4 unchanged attributes hidden)
        }
      - subnet_mapping {
          - subnet_id            = "subnet-08cee7c9e6980c483" -> null
            # (4 unchanged attributes hidden)
        }
    }

  # aws_lb_listener.http_listener must be replaced
-/+ resource "aws_lb_listener" "http_listener" {
      ~ arn                                                                   = "arn:aws:elasticloadbalancing:us-east-1:326864272150:listener/app/app-lb-production/f9cba2c528c07d5f/0ef0fb6282e5b70e" -> (known after apply)
      ~ id                                                                    = "arn:aws:elasticloadbalancing:us-east-1:326864272150:listener/app/app-lb-production/f9cba2c528c07d5f/0ef0fb6282e5b70e" -> (known after apply)
      ~ load_balancer_arn                                                     = "arn:aws:elasticloadbalancing:us-east-1:326864272150:loadbalancer/app/app-lb-production/f9cba2c528c07d5f" -> (known after apply) # forces replacement
      + routing_http_request_x_amzn_mtls_clientcert_header_name               = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_issuer_header_name        = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_leaf_header_name          = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_serial_number_header_name = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_subject_header_name       = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_validity_header_name      = (known after apply)
      + routing_http_request_x_amzn_tls_cipher_suite_header_name              = (known after apply)
      + routing_http_request_x_amzn_tls_version_header_name                   = (known after apply)
      + routing_http_response_access_control_allow_credentials_header_value   = (known after apply)
      + routing_http_response_access_control_allow_headers_header_value       = (known after apply)
      + routing_http_response_access_control_allow_methods_header_value       = (known after apply)
      + routing_http_response_access_control_allow_origin_header_value        = (known after apply)
      + routing_http_response_access_control_expose_headers_header_value      = (known after apply)
      + routing_http_response_access_control_max_age_header_value             = (known after apply)
      + routing_http_response_content_security_policy_header_value            = (known after apply)
      ~ routing_http_response_server_enabled                                  = true -> (known after apply)
      + routing_http_response_strict_transport_security_header_value          = (known after apply)
      + routing_http_response_x_content_type_options_header_value             = (known after apply)
      + routing_http_response_x_frame_options_header_value                    = (known after apply)
      + ssl_policy                                                            = (known after apply)
      - tags                                                                  = {
          - "Environment" = "production"
        } -> null
      ~ tags_all                                                              = {
          ~ "Environment" = "production" -> "prod"
            # (2 unchanged elements hidden)
        }
      + tcp_idle_timeout_seconds                                              = (known after apply)
        # (2 unchanged attributes hidden)

      ~ default_action {
          ~ order            = 1 -> (known after apply)
          ~ target_group_arn = "arn:aws:elasticloadbalancing:us-east-1:326864272150:targetgroup/app-tg-production/07ac88a00a58a699" -> (known after apply)
            # (1 unchanged attribute hidden)
        }

      ~ mutual_authentication (known after apply)
    }

  # aws_lb_target_group.app_tg must be replaced
-/+ resource "aws_lb_target_group" "app_tg" {
      ~ arn                                = "arn:aws:elasticloadbalancing:us-east-1:326864272150:targetgroup/app-tg-production/07ac88a00a58a699" -> (known after apply)
      ~ arn_suffix                         = "targetgroup/app-tg-production/07ac88a00a58a699" -> (known after apply)
      + connection_termination             = (known after apply)
      ~ id                                 = "arn:aws:elasticloadbalancing:us-east-1:326864272150:targetgroup/app-tg-production/07ac88a00a58a699" -> (known after apply)
      ~ ip_address_type                    = "ipv4" -> (known after apply)
      ~ load_balancer_arns                 = [
          - "arn:aws:elasticloadbalancing:us-east-1:326864272150:loadbalancer/app/app-lb-production/f9cba2c528c07d5f",
        ] -> (known after apply)
      ~ load_balancing_algorithm_type      = "round_robin" -> (known after apply)
      ~ load_balancing_anomaly_mitigation  = "off" -> (known after apply)
      ~ load_balancing_cross_zone_enabled  = "use_load_balancer_configuration" -> (known after apply)
      ~ name                               = "app-tg-production" -> "app-tg-prod" # forces replacement
      + name_prefix                        = (known after apply)
      + preserve_client_ip                 = (known after apply)
      ~ protocol_version                   = "HTTP1" -> (known after apply)
      ~ tags                               = {
          - "Environment" = "production" -> null
            "Name"        = "app-target-group"
        }
      ~ tags_all                           = {
          ~ "Environment" = "production" -> "prod"
            # (3 unchanged elements hidden)
        }
        # (8 unchanged attributes hidden)

      ~ health_check {
          ~ matcher             = "200" -> (known after apply)
            # (8 unchanged attributes hidden)
        }

      ~ stickiness (known after apply)
      - stickiness {
          - cookie_duration = 86400 -> null
          - enabled         = false -> null
          - type            = "lb_cookie" -> null
            # (1 unchanged attribute hidden)
        }

      ~ target_failover (known after apply)
      - target_failover {}

      ~ target_group_health (known after apply)
      - target_group_health {
          - dns_failover {
              - minimum_healthy_targets_count      = "1" -> null
              - minimum_healthy_targets_percentage = "off" -> null
            }
          - unhealthy_state_routing {
              - minimum_healthy_targets_count      = 1 -> null
              - minimum_healthy_targets_percentage = "off" -> null
            }
        }

      ~ target_health_state (known after apply)
      - target_health_state {}
    }

  # aws_nat_gateway.main[0] will be updated in-place
  ~ resource "aws_nat_gateway" "main" {
        id                                 = "nat-0d1b13ba66eb6c6ae"
      ~ tags                               = {
          - "Environment" = "production" -> null
            "Name"        = "nat-gateway-az-1"
        }
      ~ tags_all                           = {
          ~ "Environment" = "production" -> "prod"
            # (3 unchanged elements hidden)
        }
        # (10 unchanged attributes hidden)
    }

  # aws_nat_gateway.main[1] will be updated in-place
  ~ resource "aws_nat_gateway" "main" {
        id                                 = "nat-0d4a73a0143388f54"
      ~ tags                               = {
          - "Environment" = "production" -> null
            "Name"        = "nat-gateway-az-2"
        }
      ~ tags_all                           = {
          ~ "Environment" = "production" -> "prod"
            # (3 unchanged elements hidden)
        }
        # (10 unchanged attributes hidden)
    }

  # aws_route_table.private[0] will be updated in-place
  ~ resource "aws_route_table" "private" {
        id               = "rtb-0044c8b5131313de6"
      ~ tags             = {
          - "Environment" = "production" -> null
            "Name"        = "private-route-table-1"
        }
      ~ tags_all         = {
          ~ "Environment" = "production" -> "prod"
            # (3 unchanged elements hidden)
        }
        # (5 unchanged attributes hidden)
    }

  # aws_route_table.private[1] will be updated in-place
  ~ resource "aws_route_table" "private" {
        id               = "rtb-0398097bdc0fd3ff3"
      ~ tags             = {
          - "Environment" = "production" -> null
            "Name"        = "private-route-table-2"
        }
      ~ tags_all         = {
          ~ "Environment" = "production" -> "prod"
            # (3 unchanged elements hidden)
        }
        # (5 unchanged attributes hidden)
    }

  # aws_route_table.public will be updated in-place
  ~ resource "aws_route_table" "public" {
        id               = "rtb-01a15f557ac0726eb"
      ~ tags             = {
          - "Environment" = "production" -> null
            "Name"        = "public-route-table"
        }
      ~ tags_all         = {
          ~ "Environment" = "production" -> "prod"
            # (3 unchanged elements hidden)
        }
        # (5 unchanged attributes hidden)
    }

  # aws_security_group.alb_sg must be replaced
-/+ resource "aws_security_group" "alb_sg" {
      ~ arn                    = "arn:aws:ec2:us-east-1:326864272150:security-group/sg-01fbbc3ef268e4ee6" -> (known after apply)
      ~ id                     = "sg-01fbbc3ef268e4ee6" -> (known after apply)
      ~ name                   = "alb-sg-production" -> "alb-sg-prod" # forces replacement
      + name_prefix            = (known after apply)
      ~ owner_id               = "326864272150" -> (known after apply)
      ~ tags                   = {
          - "Environment" = "production" -> null
            "Name"        = "alb-security-group"
        }
      ~ tags_all               = {
          ~ "Environment" = "production" -> "prod"
            # (3 unchanged elements hidden)
        }
        # (5 unchanged attributes hidden)
    }

  # aws_security_group.allow_http must be replaced
-/+ resource "aws_security_group" "allow_http" {
      ~ arn                    = "arn:aws:ec2:us-east-1:326864272150:security-group/sg-088b7ad4442584a32" -> (known after apply)
      ~ id                     = "sg-088b7ad4442584a32" -> (known after apply)
      ~ name                   = "allow-http-production" -> "allow-http-prod" # forces replacement
      + name_prefix            = (known after apply)
      ~ owner_id               = "326864272150" -> (known after apply)
      ~ tags                   = {
          - "Environment" = "production" -> null
            "Name"        = "allow-http-deprecated"
        }
      ~ tags_all               = {
          ~ "Environment" = "production" -> "prod"
            # (3 unchanged elements hidden)
        }
        # (5 unchanged attributes hidden)
    }

  # aws_security_group.allow_https must be replaced
-/+ resource "aws_security_group" "allow_https" {
      ~ arn                    = "arn:aws:ec2:us-east-1:326864272150:security-group/sg-0557b7f16e5e4e379" -> (known after apply)
      ~ id                     = "sg-0557b7f16e5e4e379" -> (known after apply)
      ~ name                   = "allow-https-production" -> "allow-https-prod" # forces replacement
      + name_prefix            = (known after apply)
      ~ owner_id               = "326864272150" -> (known after apply)
      ~ tags                   = {
          - "Environment" = "production" -> null
            "Name"        = "allow-https-deprecated"
        }
      ~ tags_all               = {
          ~ "Environment" = "production" -> "prod"
            # (3 unchanged elements hidden)
        }
        # (5 unchanged attributes hidden)
    }

  # aws_security_group.allow_ssh must be replaced
-/+ resource "aws_security_group" "allow_ssh" {
      ~ arn                    = "arn:aws:ec2:us-east-1:326864272150:security-group/sg-06f2fd36dab1dbbdc" -> (known after apply)
      ~ id                     = "sg-06f2fd36dab1dbbdc" -> (known after apply)
      ~ name                   = "allow-ssh-production" -> "allow-ssh-prod" # forces replacement
      + name_prefix            = (known after apply)
      ~ owner_id               = "326864272150" -> (known after apply)
      ~ tags                   = {
          - "Environment" = "production" -> null
            "Name"        = "ssh-security-group"
        }
      ~ tags_all               = {
          ~ "Environment" = "production" -> "prod"
            # (3 unchanged elements hidden)
        }
        # (5 unchanged attributes hidden)
    }

  # aws_security_group.app_sg must be replaced
-/+ resource "aws_security_group" "app_sg" {
      ~ arn                    = "arn:aws:ec2:us-east-1:326864272150:security-group/sg-0d0dedfdb14d44190" -> (known after apply)
      ~ id                     = "sg-0d0dedfdb14d44190" -> (known after apply)
      ~ ingress                = [
          - {
              - cidr_blocks      = []
              - description      = "HTTP from ALB only"
              - from_port        = 80
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = [
                  - "sg-01fbbc3ef268e4ee6",
                ]
              - self             = false
              - to_port          = 80
            },
          - {
              - cidr_blocks      = []
              - description      = "HTTPS from ALB only"
              - from_port        = 443
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = [
                  - "sg-01fbbc3ef268e4ee6",
                ]
              - self             = false
              - to_port          = 443
            },
          + {
              + cidr_blocks      = []
              + description      = "HTTP from ALB only"
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = (known after apply)
              + self             = false
              + to_port          = 80
            },
          + {
              + cidr_blocks      = []
              + description      = "HTTPS from ALB only"
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = (known after apply)
              + self             = false
              + to_port          = 443
            },
        ]
      ~ name                   = "app-sg-production" -> "app-sg-prod" # forces replacement
      + name_prefix            = (known after apply)
      ~ owner_id               = "326864272150" -> (known after apply)
      ~ tags                   = {
          - "Environment" = "production" -> null
            "Name"        = "app-security-group"
        }
      ~ tags_all               = {
          ~ "Environment" = "production" -> "prod"
            # (3 unchanged elements hidden)
        }
        # (4 unchanged attributes hidden)
    }

  # aws_subnet.private[0] will be updated in-place
  ~ resource "aws_subnet" "private" {
        id                                             = "subnet-041994a3db8adf565"
      ~ tags                                           = {
          - "Environment" = "production" -> null
            "Name"        = "private-subnet-1"
        }
      ~ tags_all                                       = {
          ~ "Environment" = "production" -> "prod"
            # (3 unchanged elements hidden)
        }
        # (19 unchanged attributes hidden)
    }

  # aws_subnet.private[1] will be updated in-place
  ~ resource "aws_subnet" "private" {
        id                                             = "subnet-0122efe989f80e7a9"
      ~ tags                                           = {
          - "Environment" = "production" -> null
            "Name"        = "private-subnet-2"
        }
      ~ tags_all                                       = {
          ~ "Environment" = "production" -> "prod"
            # (3 unchanged elements hidden)
        }
        # (19 unchanged attributes hidden)
    }

  # aws_subnet.public[0] will be updated in-place
  ~ resource "aws_subnet" "public" {
        id                                             = "subnet-08cee7c9e6980c483"
      ~ tags                                           = {
          - "Environment" = "production" -> null
            "Name"        = "public-subnet-1"
        }
      ~ tags_all                                       = {
          ~ "Environment" = "production" -> "prod"
            # (3 unchanged elements hidden)
        }
        # (19 unchanged attributes hidden)
    }

  # aws_subnet.public[1] will be updated in-place
  ~ resource "aws_subnet" "public" {
        id                                             = "subnet-019e28469eac175e8"
      ~ tags                                           = {
          - "Environment" = "production" -> null
            "Name"        = "public-subnet-2"
        }
      ~ tags_all                                       = {
          ~ "Environment" = "production" -> "prod"
            # (3 unchanged elements hidden)
        }
        # (19 unchanged attributes hidden)
    }

  # aws_vpc.main will be updated in-place
  ~ resource "aws_vpc" "main" {
        id                                   = "vpc-027437c275230a1fe"
      ~ tags                                 = {
          - "Environment" = "production" -> null
            "Name"        = "main-vpc"
        }
      ~ tags_all                             = {
          ~ "Environment" = "production" -> "prod"
            # (3 unchanged elements hidden)
        }
        # (18 unchanged attributes hidden)
    }

Plan: 12 to add, 16 to change, 12 to destroy.

Changes to Outputs:
  ~ autoscaling_group_name = "app-asg-production" -> "app-asg-prod"
  ~ load_balancer_arn      = "arn:aws:elasticloadbalancing:us-east-1:326864272150:loadbalancer/app/app-lb-production/f9cba2c528c07d5f" -> (known after apply)
  ~ load_balancer_dns      = "app-lb-production-1415074233.us-east-1.elb.amazonaws.com" -> (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

Action: Auto-applying changes...